const aboutComcamp =
	'ค่ายยุวชนคอมพิวเตอร์ หรือ คอมแคมป์ สาขาวิทยาการคอมพิวเตอร์ มหาวิทยาลัยแม่โจ้เป็นกิจกรรมที่จัดขึ้นโดยสาขาวิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้เพื่อเปิดโอกาสให้น้องๆที่สนใจในสาขาวิทยาการคอมพิวเตอร์ได้มีโอกาสเรียนรู้และฝึกฝนทักษะด้านคอมพิวเตอร์อย่างสนุกสนานเป็นเวลา 3 วัน 2 คืน โดยในปี พ.ศ. 2567 จัดขึ้นระหว่างวันที่ 2-4 กุมภาพันธ์ ณ มหาวิทยาลัยแม่โจ้ จังหวัดเชียงใหม่';

const learningObjectives = [
	{
		punchline: 'Mobile Development',
		body: 'ชอบเล่นเกม? ทำไมเราไม่ลองสร้างเกมมาเล่นเองกันบ้างหล่ะ? เรียนรู้การสร้างเกมเบื้องต้นด้วย Unity และ C# กันเถอะ แล้วลองสร้างเกมของตัวเองมาเล่นกัน แล้วเราจะได้เป็นคนสร้างเกมที่เราอยากเล่น และ สร้างเกมที่เราอยากให้คนอื่นเล่นกันเถอะ'
	},
	{
		punchline: 'IOT & Microcontroller',
		body: 'ชอบเล่นเกม? ทำไมเราไม่ลองสร้างเกมมาเล่นเองกันบ้างหล่ะ? เรียนรู้การสร้างเกมเบื้องต้นด้วย Unity และ C# กันเถอะ แล้วลองสร้างเกมของตัวเองมาเล่นกัน แล้วเราจะได้เป็นคนสร้างเกมที่เราอยากเล่น และ สร้างเกมที่เราอยากให้คนอื่นเล่นกันเถอะ'
	},
	{
		punchline: 'Web Development',
		body: 'ชอบเล่นเกม? ทำไมเราไม่ลองสร้างเกมมาเล่นเองกันบ้างหล่ะ? เรียนรู้การสร้างเกมเบื้องต้นด้วย Unity และ C# กันเถอะ แล้วลองสร้างเกมของตัวเองมาเล่นกัน แล้วเราจะได้เป็นคนสร้างเกมที่เราอยากเล่น และ สร้างเกมที่เราอยากให้คนอื่นเล่นกันเถอะ'
	},
	{
		punchline: 'Artificial Intelligence & Machine Learning',
		body: 'ชอบเล่นเกม? ทำไมเราไม่ลองสร้างเกมมาเล่นเองกันบ้างหล่ะ? เรียนรู้การสร้างเกมเบื้องต้นด้วย Unity และ C# กันเถอะ แล้วลองสร้างเกมของตัวเองมาเล่นกัน แล้วเราจะได้เป็นคนสร้างเกมที่เราอยากเล่น และ สร้างเกมที่เราอยากให้คนอื่นเล่นกันเถอะ'
	}
];

const benefits = [
	{
		punchline: 'เรียนจากมือโปร',
		body: 'เรียนกับอาจารย์ที่มีประสบการณ์และเชี่ยวชาญ',
		pic: 'src/lib/assets/teacher_2.png'
	},
	{
		punchline: 'ลงมือทำจริง',
		body: 'ฝึกฝนทักษะผ่านกิจกรรมและโครงงาน',
		pic: 'src/lib/assets/pencil.png'
	},
	{
		punchline: 'ได้เพื่อนใหม่',
		body: 'พบปะเพื่อนนักเรียนที่สนใจวิทยาการคอมพิวเตอร์',
		pic: 'src/lib/assets/people_talking.png'
	},
	{
		punchline: 'สนุกไปกับการเรียนรู้',
		body: 'เรียนรู้วิทยาการคอมพิวเตอร์อย่างสนุกสนาน',
		pic: 'src/lib/assets/laugh.png'
	}
];

export { aboutComcamp, learningObjectives, benefits };
